{
  "description": "I'm a 24-year-old University of Utah graduate with a BS in Computer Science and a minor in Business. My hobbies include fitness, motorcycles, photography, video production, mountain biking, basketball, and technology.",
  "education": [
    {
      "school": "University of Utah",
      "time": "August 2018 - May 2023",
      "degree": "Bachelor of Science in Computer Science",
      "info": "Minor in Business, 3.7 GPA, Dean's List (7 Semesters), Honors Certificate",
      "coursework": [
        {
          "name": "Mobile App Development",
          "description": "Created an Android app in Kotlin, utilizing system sensors and external APIs."
        },
        {
          "name": "Web Software Architecture",
          "description": "Utilized ASP.NET to create a web app with a database hosted on AWS EC2. Learned about and implemented user roles, REST, JavaScript/HTML5, CSS, Selenium, encryption, Google analytics, Bootstrap, and XML/JSON processing."
        },
        {
          "name": "Artificial Intelligence",
          "description": "Implemented intelligent computer systems through a series of Python projects."
        },
        {
          "name": "Computer Graphics",
          "description": "Designed software to represent curves and surfaces using the GPU pipeline. Developed WebGL applications to display and manipulate 2D and 3D models on the web."
        },
        {
          "name": "Programming Languages",
          "description": "Learned functional programming techniques by creating a series of interpreters, type-checkers, and compilers."
        },
        {
          "name": "Databases",
          "description": "Created a database system using MySQL, including ER diagrams and front-end access tools."
        },
        {
          "name": "Capstone",
          "description": "Developed a React Native mobile application using a Firebase backend as a final project."
        }
      ]
    }
  ],
  "experience": [
    {
      "name": "Software Developer",
      "company": "Systems Implementers, Inc.",
      "time": "March 2023 - Present",
      "bullets": [
        "Collaborated with a team of 6-8 developers to enhance and maintain a large existing codebase of aircraft maintenance software, featuring an Angular frontend, a Java Spring backend, and an Oracle SQL database.",
        "Created new reports and implemented major changes and fixes to existing ones, ensuring productivity and accuracy for thousands of users across Hill Air Force Base who rely on these reports daily for critical operations.",
        "Led the ongoing conversion of 100+ pages from JSF to Angular frameworks, resulting in a 50% improvement in load times, enhanced user experience, and a significant decrease in development time for bug fixes and enhancements.",
        "Analyzed user requirements and translated them into technical specifications and robust software solutions.",
        "Performed manual updates and modifications to database tables to correct issues, implement changes, and ensure data integrity; performed query optimization and table indexing to improve performance by up to 200%.",
        "Drove Agile transformation, including backlog refinement, user story creation, and Kanban implementation, achieving a 30% increase in team output and becoming a certified Scrum Master.",
        "Achieved among the highest production throughput on the team within 6 months by rapidly adapting to the existing codebase and consistently delivering high-quality code and features."
      ]
    },
    {
      "name": "Software Developer Intern",
      "company": "Fidelity Investments",
      "time": "Summer 2021 & 2022",
      "bullets": [
        "Improved team workflow by decreasing build time by 20%, eliminating verbose logging data, and re-configuring the linter to promote TypeScript best practices.",
        "Worked comprehensively with TypeScript and implemented changes regarding Datadog logging and tracing, ESLint warnings and errors, and Jenkins build configurations.",
        "Practiced Agile software development in a team environment, including daily standup meetings, extensive use of Git version control, and task management within sprints."
      ]
    },
    {
      "name": "Teaching Assistant",
      "company": "University of Utah",
      "time": "January 2022 - May 2023",
      "bullets": [
        "Assisted students with assignments and exams in Java, C#, and C, focusing on essential algorithms, data structures, version control, IDEs, and programming fundamentals.",
        "Designed and conducted instructional labs to supplement student learning for Algorithms & Data Structures, Software Practice, and Foundations of Computer Science courses."
      ]
    }
  ],
  "projects": [
    {
      "name": "Fast Break",
      "description": "Developed a React Native mobile applications in a team of four to facilitate pickup basketball. Features multi-provider authentication, location-based notifications, Firebase NoSQL back-end, peer-to-peer messaging, and cross-platform compatibility."
    },
    {
      "name": "Trade Flow Dashboard",
      "description": "Worked with a team of five developers to create an internal dashboard for Fidelity Investments. Developed in Angular and deployed via a Docker container on AWS, this dashboard provides a way for brokers to track where in the pipeline any trade is."
    },
    {
      "name": "Gift Lists",
      "description": "Built a web app in Angular to enable the creation and sharing of gift wish lists. Key features include generating shareable links via a REST API call to a custom URL shortener and AI-powered gift suggestions."
    }
  ],
  "skills": [
    {
      "name": "Languages",
      "description": "Java, JavaScript, TypeScript, C#, C, C++, HTML, CSS, SQL, Python, Kotlin, Go."
    },
    {
      "name": "Technologies",
      "description": "Git, AWS, Azure, Google Cloud, Firebase, Jira, Docker, Kubernetes, MongoDB."
    },
    {
      "name": "Frameworks",
      "description": "React, React Native, Angular, Vue.js, .NET, Spring."
    },
    {
      "name": "Certifications",
      "description": "Agile Scrum Master (Scrum Alliance)."
    },
    {
      "name": "Operating Systems",
      "description": "Windows, macOS, Linux."
    },
    {
      "name": "Creative Software",
      "description": "Adobe Illustrator, Photoshop, Lightroom, Premiere."
    },
    {
      "name": "Additional Interests",
      "description": "Amateur filmmaker and photographer."
    }
  ]
}
